/*
    Роботу виконав Вітязь Денис (116-1)
    Варіант 3
*/

/*
3. Ввести одновимірний масив з n елементів. Знайти кількість нулів і
одиниць. Відсортувати масив по зростанню, методом вставкою.
*/
масив = input("Введіть масив через кому: ", "масив");


кількість_нулів = 0;
кількість_одиниць = 0;

//підрахуємо кількість нулів і одиниць
for (i = 0; i < масив.length; i++) {
    if (масив[i] == 0) {
        кількість_нулів++;
    } else if (масив[i] == 1) {
        кількість_одиниць++;
    }
}
output("Кількість нулів: " + кількість_нулів);
output("Кількість одиниць: " + кількість_одиниць);

//сортування методом вставки
for (i = 1; i < масив.length; i++) { //проходимо по масиву
    j = i - 1; //зберігаємо індекс попереднього елементу
    ціль = масив[i]; //елемент, який потрібно вставити
    while (j >= 0 && масив[j] > ціль) {
        масив[j + 1] = масив[j]; //переміщаємо елемент вправо
        j--;
    }
    масив[j + 1] = ціль; //вставляємо елемент
}

output("Відсортований масив: " + масив);